{
	"version": "https://jsonfeed.org/version/1",
	"title": "James Fee",
	"icon": "https://micro.blog/jamesfee/avatar.jpg",
	"home_page_url": "https://jamesfee.org/",
	"feed_url": "https://jamesfee.org/feed.json",
	"items": [
		
			{
				"id": "http://fee.micro.blog/2024/09/25/trying-hard-not.html",
				"title": "Trying hard not to stand on the cracks",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<img src=\"uploads/2024/e15df23356d54f8988a9e056832317f4.jpg\" width=\"450\" height=\"600\" alt=\"\">\n",
				"date_published": "2024-09-25T12:18:08-07:00",
				"url": "https://jamesfee.org/2024/09/25/trying-hard-not.html"
			},
			{
				"id": "http://fee.micro.blog/2024/09/25/leveraging-blockchain-technology.html",
				"title": "Leveraging Blockchain Technology for Enhanced Management of Digital Twins and BIM Models",
				"content_html": "<p>As the digital transformation of industries accelerates, the management of Digital Twins and Building Information Models (BIM) has emerged as a critical challenge. These models are fundamental in sectors such as construction, urban planning, and facility management, providing detailed representations of physical assets and enabling advanced simulations and analyses. However, the complexity of these models, coupled with the involvement of multiple stakeholders, presents significant challenges in maintaining data integrity, managing derivative works, and ensuring the enforcement of contracts.</p>\n<p>Blockchain technology offers a powerful solution to these challenges by providing a secure, decentralized, and transparent system for managing Digital Twins and BIM models. Here’s how blockchain can revolutionize this space:\n<strong>Data Integrity and Security</strong>:   - <strong>Example</strong>: Consider a large-scale infrastructure project involving a Digital Twin of a smart city. The model needs to be frequently updated with data from various sensors, construction teams, and urban planners. With blockchain, every update to the Digital Twin is recorded on an immutable ledger, ensuring that the data remains consistent and secure over time. This prevents unauthorized changes, ensuring that all stakeholders can trust the data’s accuracy and reliability.   - <strong>Benefit</strong>: Blockchain’s decentralized ledger makes it nearly impossible for any single entity to alter the data without detection, significantly reducing the risk of data tampering and ensuring that the Digital Twin remains a trustworthy source of information throughout the project lifecycle.\n<strong>Provenance and Traceability</strong>:   - <strong>Example</strong>: In the development of a new commercial building, the BIM model undergoes multiple iterations, with contributions from architects, engineers, and contractors. Blockchain enables each modification to the model to be logged with a timestamp and the identity of the contributor. If a design flaw is later discovered, stakeholders can trace back through the blockchain to identify who made each change, when it was made, and the rationale behind it.   - <strong>Benefit</strong>: This level of traceability ensures accountability and transparency, allowing project managers to easily audit the development process and maintain a clear history of the model’s evolution. It also simplifies the process of compliance with regulatory requirements by providing an unalterable record of the model’s development.\n<strong>Smart Contracts and Licensing</strong>:   - <strong>Example</strong>: Imagine a scenario where a BIM model is used by multiple subcontractors for different aspects of a construction project. Each contractor needs access to specific parts of the model under certain licensing agreements. With blockchain, smart contracts can automatically enforce these agreements—granting access only to authorized users and ensuring that usage complies with the predefined terms. For instance, a smart contract could be set to automatically release payment when a subcontractor completes a specific task using the BIM model, and this action would be recorded on the blockchain.   - <strong>Benefit</strong>: Smart contracts streamline the enforcement of licensing and usage agreements, reducing the administrative burden on project managers and ensuring compliance without the need for manual oversight. This automation also reduces the risk of legal disputes by ensuring that all parties adhere to the agreed-upon terms.\n<strong>Collaboration and Version Control</strong>:   - <strong>Example</strong>: In a complex project like the construction of a new transportation hub, multiple teams—ranging from civil engineers to environmental consultants—need to collaborate on the BIM model. Blockchain facilitates this by providing a single, shared ledger where every change to the model is recorded and visible to all authorized parties. If an engineer updates the model with new structural data, this update is immediately available to the entire team, and the blockchain ensures that the change is properly recorded and cannot be overwritten without consensus.   - <strong>Benefit</strong>: This approach eliminates version conflicts and ensures that all stakeholders are working from the most up-to-date data. It fosters a more collaborative environment by enabling secure, transparent sharing of information across teams, reducing the likelihood of errors and rework.\n<strong>Conclusion</strong>:\nThe integration of blockchain technology into the management of Digital Twins and BIM models provides a robust solution to some of the most pressing challenges in the construction and infrastructure sectors. By ensuring data integrity, enhancing traceability, automating contract enforcement, and improving collaboration, blockchain not only addresses current challenges but also paves the way for new opportunities in project management and digital asset management. As industries continue to adopt digital technologies, blockchain’s role in managing the complex lifecycle of Digital Twins and BIM models will become increasingly vital.</p>\n",
				"content_text": "As the digital transformation of industries accelerates, the management of Digital Twins and Building Information Models (BIM) has emerged as a critical challenge. These models are fundamental in sectors such as construction, urban planning, and facility management, providing detailed representations of physical assets and enabling advanced simulations and analyses. However, the complexity of these models, coupled with the involvement of multiple stakeholders, presents significant challenges in maintaining data integrity, managing derivative works, and ensuring the enforcement of contracts.\r\n\r\nBlockchain technology offers a powerful solution to these challenges by providing a secure, decentralized, and transparent system for managing Digital Twins and BIM models. Here’s how blockchain can revolutionize this space:\r\n**Data Integrity and Security**:   - **Example**: Consider a large-scale infrastructure project involving a Digital Twin of a smart city. The model needs to be frequently updated with data from various sensors, construction teams, and urban planners. With blockchain, every update to the Digital Twin is recorded on an immutable ledger, ensuring that the data remains consistent and secure over time. This prevents unauthorized changes, ensuring that all stakeholders can trust the data’s accuracy and reliability.   - **Benefit**: Blockchain’s decentralized ledger makes it nearly impossible for any single entity to alter the data without detection, significantly reducing the risk of data tampering and ensuring that the Digital Twin remains a trustworthy source of information throughout the project lifecycle.\r\n**Provenance and Traceability**:   - **Example**: In the development of a new commercial building, the BIM model undergoes multiple iterations, with contributions from architects, engineers, and contractors. Blockchain enables each modification to the model to be logged with a timestamp and the identity of the contributor. If a design flaw is later discovered, stakeholders can trace back through the blockchain to identify who made each change, when it was made, and the rationale behind it.   - **Benefit**: This level of traceability ensures accountability and transparency, allowing project managers to easily audit the development process and maintain a clear history of the model’s evolution. It also simplifies the process of compliance with regulatory requirements by providing an unalterable record of the model’s development.\r\n**Smart Contracts and Licensing**:   - **Example**: Imagine a scenario where a BIM model is used by multiple subcontractors for different aspects of a construction project. Each contractor needs access to specific parts of the model under certain licensing agreements. With blockchain, smart contracts can automatically enforce these agreements—granting access only to authorized users and ensuring that usage complies with the predefined terms. For instance, a smart contract could be set to automatically release payment when a subcontractor completes a specific task using the BIM model, and this action would be recorded on the blockchain.   - **Benefit**: Smart contracts streamline the enforcement of licensing and usage agreements, reducing the administrative burden on project managers and ensuring compliance without the need for manual oversight. This automation also reduces the risk of legal disputes by ensuring that all parties adhere to the agreed-upon terms.\r\n**Collaboration and Version Control**:   - **Example**: In a complex project like the construction of a new transportation hub, multiple teams—ranging from civil engineers to environmental consultants—need to collaborate on the BIM model. Blockchain facilitates this by providing a single, shared ledger where every change to the model is recorded and visible to all authorized parties. If an engineer updates the model with new structural data, this update is immediately available to the entire team, and the blockchain ensures that the change is properly recorded and cannot be overwritten without consensus.   - **Benefit**: This approach eliminates version conflicts and ensures that all stakeholders are working from the most up-to-date data. It fosters a more collaborative environment by enabling secure, transparent sharing of information across teams, reducing the likelihood of errors and rework.\r\n**Conclusion**:\r\nThe integration of blockchain technology into the management of Digital Twins and BIM models provides a robust solution to some of the most pressing challenges in the construction and infrastructure sectors. By ensuring data integrity, enhancing traceability, automating contract enforcement, and improving collaboration, blockchain not only addresses current challenges but also paves the way for new opportunities in project management and digital asset management. As industries continue to adopt digital technologies, blockchain’s role in managing the complex lifecycle of Digital Twins and BIM models will become increasingly vital.\n",
				"date_published": "2024-09-25T12:15:04-07:00",
				"url": "https://jamesfee.org/2024/09/25/leveraging-blockchain-technology.html"
			},
			{
				"id": "http://fee.micro.blog/2022/11/07/monroe-and-daddy.html",
				
				"content_html": "<p>Monroe and Daddy</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Monroe and Daddy\n\n<img src=\"uploads/2022/725fe1662d.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2022-11-07T15:30:40-07:00",
				"url": "https://jamesfee.org/2022/11/07/monroe-and-daddy.html"
			},
			{
				"id": "http://fee.micro.blog/2022/06/30/kona.html",
				
				"content_html": "<p>Kona</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Kona\n\n<img src=\"uploads/2022/c010934bbf.jpg\" width=\"600\" height=\"450\" alt=\"\" />\n",
				"date_published": "2022-06-30T21:34:10-07:00",
				"url": "https://jamesfee.org/2022/06/30/kona.html"
			},
			{
				"id": "http://fee.micro.blog/2022/06/03/my-gis-skills.html",
				"title": "My GIS Skills",
				"content_html": "<p><!-- raw HTML omitted --> 📷</p>\n",
				"content_text": "<img src=\"uploads/2022/38ff59df36.jpg\" alt=\"Gis\" title=\"gis.jpg\" border=\"0\" width=\"2160\" height=\"1350\" /> 📷\n",
				"date_published": "2022-06-03T10:34:02-07:00",
				"url": "https://jamesfee.org/2022/06/03/my-gis-skills.html"
			},
			{
				"id": "http://fee.micro.blog/2022/05/25/minute-wait.html",
				
				"content_html": "<p>30 minute wait… 📷</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "30 minute wait… 📷\n\n<img src=\"https://cdn.uploads.micro.blog/1450/2022/5ed3f79a4d.jpg\" width=\"600\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-05-25T16:49:48-07:00",
				"url": "https://jamesfee.org/2022/05/25/minute-wait.html"
			},
			{
				"id": "http://fee.micro.blog/2022/05/22/finished-reading-handson.html",
				"title": "Book Review: Hands-On Azure Digital Twins: A practical guide to building distributed IoT solutions",
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9781801073974\">Hands-On Azure Digital Twins: A practical guide to building distributed IoT solutions</a> by Alexander Meijers 📚</p>\n<p>I&rsquo;ve been working with Digital Twins for almost 10 years and as simple as the concept is, ontologies get in the way of implementations. The big deal is how can you implement, how does one actually create a digital twin and deploy it to your users.</p>\n<p>Let&rsquo;s be honest though, the Azure Digital Twin service/product is complex and requires a ton of work. It isn&rsquo;t an upload CAD drawing and connect some data sources. In this case Meijers does a great job of walking through how to get started. But it isn&rsquo;t for beginners, you&rsquo;ll need to have previous experience with Azure Cloud services, Microsoft Visual Studio and the ability to debug code. But if you&rsquo;ve got even a general understand of this, the walk throughs are detailed enough to learn the idiosyncrasies of the Azure Digital Twin process.</p>\n<p>The book does take you through the process of understanding what an Azure Digital Twin model is, how to upload them, developing relationships between models and how to query them. After you have an understanding on this, Meijers dives into connecting the model to services, updating the Azure Digital Twin models and then connecting to Microsoft Azure Maps to view the model on maps. Finally he showcases how these Digital Twins can become smart buildings which is the hopeful outcome of doing all the work.</p>\n<p>The book has a lot of code examples and ability to download it all from a Github repository. Knowledge of JSON and JavaScript, Python and .NET or Java is probably required. BUT, even if you don&rsquo;t know how to code, this book is a good introduction to Azure Digital Twins. While there are pages of code examples, Meijers does a good job of explaining the how and why you would use Azure Digital Twins. If you&rsquo;re interesting in how you can use a hosted Digital Twin service that is managed by a cloud service, this is a great resource.</p>\n<p>I felt like I knew Azure Digital Twins before reading this book, but it taught me a lot about how and why Microsoft did what they did with the service. Many aspects that caused me to scratch my head became clearer to me and I felt like this book gave me additional background that I didn&rsquo;t have before. This book requires an understanding of programming but after finishing it I felt like Meijers' ability to describe the process outside of code makes the book well worth it to anyone who wants to understand the concept and architecture of Azure Digital Twins.</p>\n<p>Thoroughly enjoyed the book.</p>\n",
				"content_text": "Finished reading: [Hands-On Azure Digital Twins: A practical guide to building distributed IoT solutions](https://micro.blog/books/9781801073974) by Alexander Meijers 📚\n\nI've been working with Digital Twins for almost 10 years and as simple as the concept is, ontologies get in the way of implementations. The big deal is how can you implement, how does one actually create a digital twin and deploy it to your users.\n\nLet's be honest though, the Azure Digital Twin service/product is complex and requires a ton of work. It isn't an upload CAD drawing and connect some data sources. In this case Meijers does a great job of walking through how to get started. But it isn't for beginners, you'll need to have previous experience with Azure Cloud services, Microsoft Visual Studio and the ability to debug code. But if you've got even a general understand of this, the walk throughs are detailed enough to learn the idiosyncrasies of the Azure Digital Twin process.\n\nThe book does take you through the process of understanding what an Azure Digital Twin model is, how to upload them, developing relationships between models and how to query them. After you have an understanding on this, Meijers dives into connecting the model to services, updating the Azure Digital Twin models and then connecting to Microsoft Azure Maps to view the model on maps. Finally he showcases how these Digital Twins can become smart buildings which is the hopeful outcome of doing all the work.\n\nThe book has a lot of code examples and ability to download it all from a Github repository. Knowledge of JSON and JavaScript, Python and .NET or Java is probably required. BUT, even if you don't know how to code, this book is a good introduction to Azure Digital Twins. While there are pages of code examples, Meijers does a good job of explaining the how and why you would use Azure Digital Twins. If you're interesting in how you can use a hosted Digital Twin service that is managed by a cloud service, this is a great resource.\n\nI felt like I knew Azure Digital Twins before reading this book, but it taught me a lot about how and why Microsoft did what they did with the service. Many aspects that caused me to scratch my head became clearer to me and I felt like this book gave me additional background that I didn't have before. This book requires an understanding of programming but after finishing it I felt like Meijers' ability to describe the process outside of code makes the book well worth it to anyone who wants to understand the concept and architecture of Azure Digital Twins.\n\nThoroughly enjoyed the book.\n",
				"date_published": "2022-05-22T14:00:00-07:00",
				"url": "https://jamesfee.org/2022/05/22/finished-reading-handson.html"
			},
			{
				"id": "http://fee.micro.blog/2022/05/21/splash-pad-saturday.html",
				
				"content_html": "<p>Splash pad Saturday</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Splash pad Saturday \n\n<img src=\"https://cdn.uploads.micro.blog/1450/2022/12969a6576.jpg\" width=\"600\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-05-21T16:26:10-07:00",
				"url": "https://jamesfee.org/2022/05/21/splash-pad-saturday.html"
			},
			{
				"id": "http://fee.micro.blog/2022/05/20/water-table-time.html",
				
				"content_html": "<p>Water table time! 📷\n<img src=\"https://cdn.uploads.micro.blog/1450/2022/b5cc1bdafa.jpg\" alt=\"F25B0DB4-46C8-4DEE-9AEE-2C4019ED74B2.jpg\"></p>\n",
				"content_text": "Water table time! 📷\n![F25B0DB4-46C8-4DEE-9AEE-2C4019ED74B2.jpg](https://cdn.uploads.micro.blog/1450/2022/b5cc1bdafa.jpg)\n",
				"date_published": "2022-05-20T15:41:29-07:00",
				"url": "https://jamesfee.org/2022/05/20/water-table-time.html"
			},
			{
				"id": "http://fee.micro.blog/2022/05/16/me-id-like.html",
				
				"content_html": "<p>Me: I&rsquo;d like a little basil for a small dish tonight.</p>\n<p>Instacart: Here is a tree of basil.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/1450/2022/e7aa5c2501.jpg\" alt=\"29B4FE25-788B-40EA-98BC-A09820C4DB79.jpg\"></p>\n<p>📷</p>\n",
				"content_text": "Me: I'd like a little basil for a small dish tonight. \n\nInstacart: Here is a tree of basil. \n\n![29B4FE25-788B-40EA-98BC-A09820C4DB79.jpg](https://cdn.uploads.micro.blog/1450/2022/e7aa5c2501.jpg)\n\n📷\n",
				"date_published": "2022-05-16T15:07:51-07:00",
				"url": "https://jamesfee.org/2022/05/16/me-id-like.html"
			},
			{
				"id": "http://fee.micro.blog/2022/05/16/gltf-is-the.html",
				"title": "glTF is the JPEG of Digital Twins",
				"content_html": "<p><a href=\"https://venturebeat.com/2022/05/11/why-gltf-is-the-jpeg-for-the-metaverse-and-digital-twins/\">Why glTF is the JPEG for the metaverse and digital twins</a></p>\n<blockquote>\n<p>JPEG took advantage of various compression tricks to dramatically shrink images compared to other formats like GIF. The latest version of glTF similarly takes advantage of techniques for compressing both geometry of 3D objects and their textures.</p>\n</blockquote>\n<p>I actually like this analogy.  Consider what <a href=\"https://spatiallyadjusted.com/open-environments-and-digital-twins/\">I said 2 years ago</a>:</p>\n<blockquote>\n<p>It is widely supported these days but it really isn’t a great format for BIM models or other digital twin layers because it is more of a visual format than a data storage model. Think of it similar to a JPEG, great for final products, but you don’t want to work with it for your production data.</p>\n</blockquote>\n<p><a href=\"https://technical.buildingsmart.org/standards/ifc/\">IFC</a> is a much better format for Digital Twins but glTF does a great job with interoperability and storage.  Much like you might want to store GIS data in a Geodatabase and share a map with JPEG, you should store your data in IFC and share as glTF.</p>\n<p>    🏢</p>\n",
				"content_text": "[Why glTF is the JPEG for the metaverse and digital twins](https://venturebeat.com/2022/05/11/why-gltf-is-the-jpeg-for-the-metaverse-and-digital-twins/)\n\n> JPEG took advantage of various compression tricks to dramatically shrink images compared to other formats like GIF. The latest version of glTF similarly takes advantage of techniques for compressing both geometry of 3D objects and their textures.\n\nI actually like this analogy.  Consider what [I said 2 years ago](https://spatiallyadjusted.com/open-environments-and-digital-twins/):\n\n> It is widely supported these days but it really isn’t a great format for BIM models or other digital twin layers because it is more of a visual format than a data storage model. Think of it similar to a JPEG, great for final products, but you don’t want to work with it for your production data.\n\n[IFC](https://technical.buildingsmart.org/standards/ifc/) is a much better format for Digital Twins but glTF does a great job with interoperability and storage.  Much like you might want to store GIS data in a Geodatabase and share a map with JPEG, you should store your data in IFC and share as glTF.\n\n    🏢\n",
				"date_published": "2022-05-16T13:53:32-07:00",
				"url": "https://jamesfee.org/2022/05/16/gltf-is-the.html"
			},
			{
				"id": "http://fee.micro.blog/2022/05/15/spring.html",
				
				"content_html": "<p>Spring! Emmy picking flowers.  She&rsquo;s a child of the earth. 📷</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Spring! Emmy picking flowers.  She's a child of the earth. 📷\n\n<img src=\"https://cdn.uploads.micro.blog/1450/2022/5e9284ea0b.jpg\" width=\"600\" height=\"450\" alt=\"\" />\n",
				"date_published": "2022-05-15T13:51:00-07:00",
				"url": "https://jamesfee.org/2022/05/15/spring.html"
			},
			{
				"id": "http://fee.micro.blog/2022/05/15/connor-in-italy.html",
				"title": "Connor in Italy",
				"content_html": "<p>My son&rsquo;s graduation present (delayed a year because of COVID) was a trip to Italy.  I&rsquo;m stuck at home with two sick kids with earaches, watching him through <a href=\"https://en.wikipedia.org/wiki/Find_My\">Find My app</a>.  I&rsquo;m so proud of him and excited for him to see Italy.</p>\n<!-- raw HTML omitted -->\n<p>Plus he got to buy his first legal beer at the Heathrow Airport.</p>\n<!-- raw HTML omitted -->\n<p>🇮🇹</p>\n",
				"content_text": "My son's graduation present (delayed a year because of COVID) was a trip to Italy.  I'm stuck at home with two sick kids with earaches, watching him through [Find My app](https://en.wikipedia.org/wiki/Find_My).  I'm so proud of him and excited for him to see Italy.\n\n<img src=\"https://cdn.uploads.micro.blog/1450/2022/fe856bbb66.png\" alt=\"Connor in Rome\" title=\"Connor_in_Rome_2022.png\" border=\"0\" width=\"450\" />\n\nPlus he got to buy his first legal beer at the Heathrow Airport.  \n\n<img src=\"https://cdn.uploads.micro.blog/1450/2022/9ecd18a66d.png\" alt=\"IMG 4569\" title=\"IMG_4569.png\" border=\"0\" width=\"450\" height=\"600\" />\n\n🇮🇹\n",
				"date_published": "2022-05-15T13:12:21-07:00",
				"url": "https://jamesfee.org/2022/05/15/connor-in-italy.html"
			},
			{
				"id": "http://fee.micro.blog/2022/05/14/years-ago-microsoft.html",
				"title": "10 Years Ago: Microsoft TerraServer Closes",
				"content_html": "<p>Funny how when you start talking about something, it triggers some other thing.  Well in a discussion about SpaceX with friends, I began to think about <a href=\"https://en.wikipedia.org/wiki/Microsoft_Research_Maps\">TerraServer</a>.  I couldn&rsquo;t remember what happened to it, but of course <a href=\"https://spatiallyadjusted.com/microsoft-terraserver-is-no-more/\">I blogged about it</a> over 10 years ago.</p>\n<blockquote>\n<p>In its time, I used it to test WMS, but I’m not sure I ever really used it for anything else. Much like LandSat, I’ll shed no tears. It served its purpose and now it must die.</p>\n</blockquote>\n<p>OUCH!  Boy, I hope when I go I get a better eulogy.  I don&rsquo;t think I was being completely fair about TerraServer.  I mean <a href=\"https://en.wikipedia.org/wiki/Jim_Gray_(computer_scientist)\">Jim Gray</a>, scaling SQL Server on Windows NT, how could one not geek out.  I used to be very hard to get access to open data and TerraServer did bring a ton of imagery data to users.</p>\n<p>I mean unpack <a href=\"https://www.microsoft.com/en-us/research/publication/the-microsoft-terraservertm/\">this</a>:</p>\n<blockquote>\n<p>The TerraServer demonstrates the scalability of Microsoft’s Windows NT Server and SQL Server running on Compaq AlphaServer 8400 and StorageWorks™ hardware.</p>\n</blockquote>\n<p>That&rsquo;s the world it grew up in. Cheers TerraServer! 🗺</p>\n",
				"content_text": "Funny how when you start talking about something, it triggers some other thing.  Well in a discussion about SpaceX with friends, I began to think about [TerraServer](https://en.wikipedia.org/wiki/Microsoft_Research_Maps).  I couldn't remember what happened to it, but of course [I blogged about it](https://spatiallyadjusted.com/microsoft-terraserver-is-no-more/) over 10 years ago.\n\n> In its time, I used it to test WMS, but I’m not sure I ever really used it for anything else. Much like LandSat, I’ll shed no tears. It served its purpose and now it must die.\n\nOUCH!  Boy, I hope when I go I get a better eulogy.  I don't think I was being completely fair about TerraServer.  I mean [Jim Gray](https://en.wikipedia.org/wiki/Jim_Gray_(computer_scientist)), scaling SQL Server on Windows NT, how could one not geek out.  I used to be very hard to get access to open data and TerraServer did bring a ton of imagery data to users.\n\nI mean unpack [this](https://www.microsoft.com/en-us/research/publication/the-microsoft-terraservertm/):\n> The TerraServer demonstrates the scalability of Microsoft’s Windows NT Server and SQL Server running on Compaq AlphaServer 8400 and StorageWorks™ hardware.\n\nThat's the world it grew up in. Cheers TerraServer! 🗺\n",
				"date_published": "2022-05-14T13:49:44-07:00",
				"url": "https://jamesfee.org/2022/05/14/years-ago-microsoft.html"
			},
			{
				"id": "http://fee.micro.blog/2022/05/12/end-of-ipod.html",
				"title": "End of iPod",
				"content_html": "<p>I was just thinking about the iPod today and how it used to be such a critical part of my life.  Now not only do I not use an iPod but I don&rsquo;t even buy my music anymore, just use <a href=\"https://www.apple.com/apple-music/\">Apple Music</a>.  But back then, fitting all my music on an iPod was amazing.</p>\n<p>The last iPod I ever bought was this one, an iPod nano 7th generation.</p>\n<!-- raw HTML omitted -->\n<p>I bought it for my wedding back in 2015.  I wanted to make sure our song for the first dance was not screwed up and I had zero faith the band could manage it without something as simple as an iPod.  Because engraving was free, I added this touch.</p>\n<!-- raw HTML omitted -->\n<p>It ended up being true. 🎶</p>\n",
				"content_text": "I was just thinking about the iPod today and how it used to be such a critical part of my life.  Now not only do I not use an iPod but I don't even buy my music anymore, just use [Apple Music](https://www.apple.com/apple-music/).  But back then, fitting all my music on an iPod was amazing.  \n\nThe last iPod I ever bought was this one, an iPod nano 7th generation.\n\n<img src=\"https://fee.micro.blog/uploads/2022/e7a27e1ae2.png\" alt=\"7th generation iPod nano\" title=\"7th generation iPod nano\" border=\"0\" width=\"450\" height=\"600\" />\n\nI bought it for my wedding back in 2015.  I wanted to make sure our song for the first dance was not screwed up and I had zero faith the band could manage it without something as simple as an iPod.  Because engraving was free, I added this touch.\n\n<img src=\"https://fee.micro.blog/uploads/2022/b94a765ce3.png\" alt=\"Last iPod\" title=\"Back of the nano\" border=\"0\" width=\"599\" height=\"490\" />\n\nIt ended up being true. 🎶\n",
				"date_published": "2022-05-12T14:28:00-07:00",
				"url": "https://jamesfee.org/2022/05/12/end-of-ipod.html"
			},
			{
				"id": "http://fee.micro.blog/2022/05/12/passing-the-torch.html",
				"title": "Passing the torch to my son",
				"content_html": "<p>This spring, my son changed his major to GIS.  He almost did Geography, but I was able to convince him these computers are going to take off eventually and he needs to have something more modern.  He&rsquo;s finished up his first semester and he says he loves it. We&rsquo;ll see!</p>\n<p>I told him all that matters is he spends time on Python.  I&rsquo;ve already exposed him to it when his major was Biology, but I would wager it means even more for GIS.  He starts some of these classes this fall so I can&rsquo;t wait to see what they are teaching him at Arizona State&rsquo;s <a href=\"https://sgsup.asu.edu\">School of Geographical Sciences &amp; Urban Planning</a>.</p>\n<p>🗺</p>\n",
				"content_text": "This spring, my son changed his major to GIS.  He almost did Geography, but I was able to convince him these computers are going to take off eventually and he needs to have something more modern.  He's finished up his first semester and he says he loves it. We'll see!\n\nI told him all that matters is he spends time on Python.  I've already exposed him to it when his major was Biology, but I would wager it means even more for GIS.  He starts some of these classes this fall so I can't wait to see what they are teaching him at Arizona State's [School of Geographical Sciences & Urban Planning](https://sgsup.asu.edu).\n\n🗺\n",
				"date_published": "2022-05-12T11:58:48-07:00",
				"url": "https://jamesfee.org/2022/05/12/passing-the-torch.html"
			},
			{
				"id": "http://fee.micro.blog/2022/05/12/micro-blogging-over.html",
				"title": "Micro blogging over Twitter",
				"content_html": "<p>I&rsquo;ve been thinking about how to start sharing content again.  I have a couple ways in the past but they are all disjointed:</p>\n<ul>\n<li>\n<p><a href=\"https://www.spatiallyadjusted.com\">Spatially Adjusted</a> - my blog I&rsquo;ve been posting to since 2005.  I feel like has done what it needed to do and I need to move on.  Great content, but that&rsquo;s not how I work anymore.</p>\n</li>\n<li>\n<p><a href=\"http://spatialtau.spatiallyadjusted.com\">Spatial Tau</a> - my newsletter.  I&rsquo;ve been hot and cold with this, I have some of the best reactions from people about it, but I don&rsquo;t like the interface.  I <em>could</em> move people over here but I don&rsquo;t know if that is the best solution.  Maybe content is needed.</p>\n</li>\n<li>\n<p>Podcasts - I&rsquo;ve had a couple; <a href=\"https://www.youtube.com/channel/UC_Yvo5bLRe17RR0nNvy6L0Q\">Hangouts with James Fee</a>, Cageyjames and Geobabbler are probably the two biggest ones.  I just haven&rsquo;t had time to edit a podcast anymore.</p>\n</li>\n<li>\n<p><a href=\"https://www.twitter.com/cageyjames\">Twitter</a> - @cageyjames&hellip; enough said</p>\n<p>I backed micro.blog years ago on Kickstarter and I&rsquo;ve liked the interface, so maybe this is where I&rsquo;ll try and post now.  I reserve the right to change my mind.</p>\n</li>\n</ul>\n<p>Photo by <a href=\"https://unsplash.com/@heytowner\">JOHN TOWNER</a></p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I've been thinking about how to start sharing content again.  I have a couple ways in the past but they are all disjointed:\n\n* [Spatially Adjusted](https://www.spatiallyadjusted.com) - my blog I've been posting to since 2005.  I feel like has done what it needed to do and I need to move on.  Great content, but that's not how I work anymore.\n* [Spatial Tau](http://spatialtau.spatiallyadjusted.com) - my newsletter.  I've been hot and cold with this, I have some of the best reactions from people about it, but I don't like the interface.  I *could* move people over here but I don't know if that is the best solution.  Maybe content is needed.\n* Podcasts - I've had a couple; [Hangouts with James Fee](https://www.youtube.com/channel/UC_Yvo5bLRe17RR0nNvy6L0Q), Cageyjames and Geobabbler are probably the two biggest ones.  I just haven't had time to edit a podcast anymore.\n* [Twitter](https://www.twitter.com/cageyjames) - @cageyjames... enough said\n\n  I backed micro.blog years ago on Kickstarter and I've liked the interface, so maybe this is where I'll try and post now.  I reserve the right to change my mind.\n  \nPhoto by [JOHN TOWNER](https://unsplash.com/@heytowner)\n\n<img src=\"https://fee.micro.blog/uploads/2022/4887dbee4d.jpg\" width=\"600\" height=\"475\" alt=\"\" />\n",
				"date_published": "2022-05-12T11:24:00-07:00",
				"url": "https://jamesfee.org/2022/05/12/micro-blogging-over.html"
			}
	]
}
